Tekla Open API Reference for Tekla Structures 2025
Identifier Constructor
 Constructs an empty identifier.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier()
Public Sub New
See Also
Reference
Identifier Class
Identifier Overload
Tekla.Structures Namespace